/*
	Modulemgr 1.50
	by Davee

	Used for Utopia
*/

#include <pspkernel.h>
#include <pspsysmem_kernel.h>
#include <pspthreadman_kernel.h>

#include <stdio.h>
#include <string.h>

#include "loadcore.h"

PSP_MODULE_INFO("sceModuleManager", 0x3007, 1, 2);

typedef struct
{
	SceUID exe_thid; //0
	SceUID sema_id;//4
	SceUID event_id; //8
	SceUID user_thread;//12
	SceUID *unk2;//16 (unused)
} ModuleMgrUIDStruct; //0x6550

/*typedef struct
{
	SceModule *	next; //0, 0x00
	u16 		attribute; //4, 0x04
	u8 			version[2]; //6, 0x06
	char 		modname[27]; //8, 0x08
	char 		terminal; //35, 0x23
	u16 		status; //36, 0x24 (AND 0x100 ? (usermodule) | (kernelmodule))
	u16 		padding; //38, 0x26
	u32 		unk_28; //40, 0x28
	SceUID 		modid; //44, 0x2C
	SceUID 		usermod_thid; //48, 0x30
	SceUID 		memid; //52, 0x34
	SceUID 		mpidtext; //56, 0x38
	SceUID 		mpiddata; //60, 0x3C
	void *		ent_top; //64, 0x40
	u32 		ent_size; //68, 0x44
	void *		stub_top; //72, 0x48
	u32 		stub_size; //76, 0x4C
	int 		(* module_start)(SceSize, void *); //80, 0x50
	int 		(* module_stop)(SceSize, void *); //84, 0x54
	int 		(* module_bootstart)(SceSize, void *); //88, 0x58
	int 		(* module_reboot_before)(SceSize, void *); //92, 0x5C
	int 		(* module_reboot_phase)(SceSize, void *); //96, 0x60
	u32 		entry_addr; //100, 0x64(seems to be repeated)
	u32 		gp_value; //104, 0x68
	u32 		text_addr; //108, 0x6C
	u32 		text_size; //112, 0x70
	u32 		data_size; //116, 0x74
	u32 		bss_size; //120, 0x78
	u8 			nsegment; //124, 0x7C
	u8			padding[3]; //125, 0x7D
	u32 		segmentaddr[4]; //128, 0x80
	u32 		segmentsize[4]; //144, 0x90
	int 		module_start_thread_priority; //160, 0xA0
	SceSize 	module_start_thread_stacksize; //164, 0xA4
	SceUInt 	module_start_thread_attr; //168, 0xA8
	int 		module_stop_thread_priority; //172, 0xAC
	SceSize 	module_stop_thread_stacksize; //176, 0xB0
	SceUInt 	module_stop_thread_attr; //180, 0xB4
	int 		module_reboot_before_thread_priority; //184, 0xB8
	SceSize 	module_reboot_before_thread_stacksize; //188, 0xBC
	SceUInt 	module_reboot_before_thread_attr; //192, 0xC0
} SceModule;*/

typedef struct
{
	u8 mode_start; //0 The Operation to start on, Use one of the ModuleMgrExeModes modes
	u8 mode_finish; //1 The Operation to finish on, Use one of the ModuleMgrExeModes modes
	u8 position; //2
	u8 access; //3
	u32 apitype; //4
	SceUID *return_id; //8
	SceModule *mod; //12
	SceUID mpidtext; //16
	SceUID mpiddata; //20
	SceUID mpidstack; //24
	SceSize stacksize; //28
	int priority; //32
	u32 attribute; //36
	SceUID modid; //40
	SceUID caller_modid; //44
	SceUID fd; //48
	SceLoadCoreExecFileInfo *exec_info; //52
	void *file_buffer; //56
	SceSize argsize; //60
	void *argp;
	u32 unk_68;
	u32 unk_72;
	int *status;
	u32 event_id; //80
	u32 unk_84; //84
	u32 unk_88; //88
} SceModuleMgrParam;

typedef struct
{
	char pbp_magic[4]; //0
	u32 pbp_version; //4
	u32 ofs_param; //8
	u32 ofs_icon0;//12
	u32 ofs_icon1;//16
	u32 ofs_pic0;//20
	u32 ofs_pic1;//24
	u32 ofs_snd0;//28
	u32 ofs_data;//32
	u32 ofs_psar; //36
} pbpFileStructure;

/*typedef struct SceKernelModuleInfo
{
	SceSize			size; //0
	char 			nsegment; //4
	char 			reserved[3]; //5
	u32 			segmentaddr[4]; //8
	u32 			segmentsize[4]; //24
	unsigned int    entry_addr; //40
	unsigned int    gp_value; //44
	unsigned int    text_addr;//48
	unsigned int    text_size;//52
	unsigned int    data_size;//56
	unsigned int    bss_size;//60
	unsigned short  attribute;//64
	unsigned char   version[2];//66
	char            name[27];
	char 			terminal;
} SceKernelModuleInfo;*/

enum ModuleMgrMcbStatus
{
	MCB_STATUS_NOT_LOADED, //0
	MCB_STATUS_LOADING, //1
	MCB_STATUS_LOADED, //2
	MCB_STATUS_RELOCATED, //3
	MCB_STATUS_STARTING, //4
	MCB_STATUS_STARTED, //5
	MCB_STATUS_STOPPING, //6
	MCB_STATUS_STOPPED, //7
	MCB_STATUS_UNLOADED, //8
};

enum ModuleMgrExeModes
{
	EXE_MODE_LOAD_MODULE, //0
	EXE_MODE_RELOCATE_MODULE, //1
	EXE_MODE_START_MODULE, //2
	EXE_MODE_STOP_MODULE, //3
	EXE_MODE_UNLOAD, //Unregister also?
};

enum ModuleMgrApiType
{
	MODULEMGR_API_LOADMODULE 			= 0x10,
	MODULEMGR_API_LOADMODULE_MS 		= 0x11,
	MODULEMGR_API_LOADMODULE_VSH 		= 0x20,
	MODULEMGR_API_LOADMODULE_USBWLAN	= 0x30,
};

enum ModuleMgrIoCtl
{
	SCE_IOCTL_PERMIT_LOADMODULE 	= 0x8001,
	SCE_IOCTL_PERMIT_LOADMODULE_MS 	= 0x8002,
	SCE_IOCTL_PERMIT_LOADMODULE_VSH	= 0x8003,
};

#define MCB_STATUS_USERMODE(v) (v & 0x100)
#define SET_MCB_STATUS(v, m) (v = (v & 0xFFF0) | m)

//GP
